In [13]:
import numpy as np 
import pandas as pd # data manipulation
import matplotlib.pyplot as plt # plotting library
import seaborn as sns

In [8]:
df_basic = pd.read_csv('title_basics_2018.csv')
df_basic.head()

,tconst,primaryTitle,originalTitle,year,runtimeMinutes,genres
0,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122,Drama
1,tt0111414,A Thin Life,A Thin Life,2018,75,Comedy
2,tt0170651,T.G.M. - osvoboditel,T.G.M. - osvoboditel,2018,60,Documentary
3,tt0192528,Heaven & Hell,Reverse Heaven,2018,104,Drama
4,tt0253093,Gangavataran,Gangavataran,2018,134,\N

In [9]:
df_rating = pd.read_csv('title_ratings.csv')
df_rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.6      1543
1  tt0000002            6.1       186
2  tt0000003            6.5      1201
3  tt0000004            6.2       114
4  tt0000005            6.1      1921

In [10]:
df_basic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12815 entries, 0 to 12814
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          12815 non-null  object
 1   primaryTitle    12815 non-null  object
 2   originalTitle   12815 non-null  object
 3   year            12815 non-null  int64
 4   runtimeMinutes  12815 non-null  int64
 5   genres          12815 non-null  object
dtypes: int64(2), object(4)
memory usage: 600.8+ KB

In [11]:
df_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 985459 entries, 0 to 985458
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         985459 non-null  object
 1   averageRating  985459 non-null  float64
 2   numVotes       985459 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 22.6+ MB

In [16]:
df_basic.describe()

          year  runtimeMinutes
count  12815.0    12815.000000
mean    2018.0       87.887163
std        0.0       33.998296
min     2018.0        1.000000
25%     2018.0       73.000000
50%     2018.0       89.000000
75%     2018.0      101.000000
max     2018.0     1320.000000

In [17]:
df_rating.describe()

       averageRating      numVotes
count  985459.000000  9.854590e+05
mean        6.886208  9.577535e+02
std         1.401076  1.565533e+04
min         1.000000  5.000000e+00
25%         6.100000  9.000000e+00
50%         7.100000  2.000000e+01
75%         7.900000  7.600000e+01
max        10.000000  2.151694e+06